import json

from src.services import finder, tel_finder


def test_finder(list_transactions):
    # тест на присутствие искомых транзакций
    result = finder(list_transactions, "Супермаркеты")
    expected = json.dumps(
        [
            {
                "MCC": 5499.0,
                "Бонусы (включая кэшбэк)": 1,
                "Валюта операции": "RUB",
                "Валюта платежа": "RUB",
                "Дата операции": "03.01.2018 15:03:35",
                "Дата платежа": "04.01.2018",
                "Категория": "Супермаркеты",
                "Кэшбэк": "nan",
                "Номер карты": "*7197",
                "Округление на инвесткопилку": 0,
                "Описание": "Magazin 25",
                "Статус": "OK",
                "Сумма операции": -73.06,
                "Сумма операции с округлением": 73.06,
                "Сумма платежа": -73.06,
            }
        ],
        ensure_ascii=False,
    )

    assert result == expected

    # тест на отсутствие искомых транзакций
    result_clear = finder(list_transactions, "lisdjfhkjhd")
    expected_clear = "искомые транзакции отсутствуют"

    assert result_clear == expected_clear


def test_tel_finder(list_transactions):
    # тест на присутствие искомых транзакций
    result = tel_finder(list_transactions)
    expected = json.dumps(
        [
            {
                "MCC": "nan",
                "Бонусы (включая кэшбэк)": 0,
                "Валюта операции": "RUB",
                "Валюта платежа": "RUB",
                "Дата операции": "31.01.2019 13:34:15",
                "Дата платежа": "31.01.2019",
                "Категория": "Мобильная связь",
                "Кэшбэк": "nan",
                "Номер карты": "nan",
                "Округление на инвесткопилку": 0,
                "Описание": "Teletie Бизнес +7 966 00-00-00",
                "Статус": "OK",
                "Сумма операции": -35.0,
                "Сумма операции с округлением": 35.0,
                "Сумма платежа": -35.0,
            }
        ],
        ensure_ascii=False,
    )

    assert result == expected

    # тест на отсутствие искомых транзакций
    result_clear = tel_finder(
        [
            {
                "MCC": 5499.0,
                "Бонусы (включая кэшбэк)": 1,
                "Валюта операции": "RUB",
                "Валюта платежа": "RUB",
                "Дата операции": "03.01.2018 15:03:35",
                "Дата платежа": "04.01.2018",
                "Категория": "Супермаркеты",
                "Кэшбэк": "nan",
                "Номер карты": "*7197",
                "Округление на инвесткопилку": 0,
                "Описание": "Magazin 25",
                "Статус": "OK",
                "Сумма операции": -73.06,
                "Сумма операции с округлением": 73.06,
                "Сумма платежа": -73.06,
            }
        ]
    )
    expected_clear = "транзакции с телефонными номерами отсутствуют"

    assert result_clear == expected_clear
